app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT * FROM "movies"

  def create
    @movie = Movie.new(params[:movie])
    if(@movie.save)
---
INSERT INTO "movies" ("created_at", "title", "director", "updated_at", "release_date", "lead_actor") VALUES('2011-03-15 08:50:54', '', '', '2011-03-15 08:50:54', NULL, NULL)

  def show
    @movie = Movie.find(params[:id])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 123) LIMIT 1

  def edit
    @movie = Movie.find(params[:id])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 1)

  def update
    @movie = Movie.find(params[:id])
    @movie.update_attributes!(params[:movie])
---
SELECT * FROM "movies" WHERE ("movies"."id" = 1)
UPDATE "movies" SET "updated_at" = '2011-03-14 15:36:03', "title" = 'Supercool first movie, Redux' WHERE "id" = 1

  def destroy
    Movie.destroy(params[:id])
---
DELETE FROM "movies" WHERE "id" = 3