app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("created_at", "author", "movie_id", "updated_at", "text") VALUES('2011-03-15 10:47:39', 'Beginning with filter', 10, '2011-03-15 10:47:39', 'Test Test
---
  def create
    @review = @movie.reviews.create(params[:review])

SELECT * FROM "reviews" WHERE ("reviews"."id" = 3)
---
  def show
    @review = Review.find(params[:id])

SELECT * FROM "movies" WHERE ("movies"."id" = 14)
---
  def find_movie
    @movie = Movie.find(params[:movie_id])