app/controllers/sessions_controller.rb

SELECT * FROM "users" WHERE ("users"."username" = 'daniel') LIMIT 1
---
  def create
    @user = User.find_by_username(params[:username])