app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username", "password") VALUES('2011-03-15 13:28:24', '2011-03-15 13:28:24', 'daniel', 'hello')
---
  def create
    @user = User.new(params[:user])
    if(@user.save)